;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! general)
(package! bookmark+)
(package! hl-anything)
(package! tldr)
(package! dash-at-point)
(package! feature-mode)

(package! deadgrep)
(package! elpa-mirror)
(package! keyfreq)
(package! isend-mode)
(package! powerthesaurus)
(package! define-word)
(package! vlf)
(package! engine-mode)
(package! tiny)
(package! super-save)

(package! wand)

(package! visual-regexp)
(package! visual-regexp-steroids)

; mess up code too easily
; package: aggressive-indent-mode

;; does not work well with doom emacs yet
;; (package! poet-theme)

;; not sure how useful it is
;; (package! outshine)

;; not quite get it..
;; (package! lentic)
