;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! bookmark+)
(package! hl-anything)
(package! tldr)
(package! dash-at-point)
(package! deadgrep)
(package! wand)
(package! tiny)
(package! engine-mode)

(package! vlf)
(package! super-save)
(package! feature-mode)
(package! eacl)

(package! org-jira)
(package! org-brain)
;; (package! visual-regexp)
;; (package! visual-regexp-steroids)


;; (package! keyfreq)
;;
;;
;; google-translate is more useful
;;(package! define-word)

;; not working, fail to connect
;; (package! powerthesaurus)
;;
; mess up code too easily
; package: aggressive-indent-mode

;; does not work well with doom emacs yet
;; (package! poet-theme)

;; not sure how useful it is
;; (package! outshine)

;; not quite get it..
;; (package! lentic)
